# Renaming columns

In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [5]:
ufo.rename(columns = {'Colors Reported':'Colors_Reported','Shape Reported':'Shape_Reported'},inplace = True)

In [6]:
ufo.head()

                   City Colors_Reported Shape_Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

### Rename all column names

In [7]:
ufo_cols = ['city','colors','shape','states_in_short','Timestamp']

In [8]:
ufo.columns = ufo_cols

In [9]:
ufo.head()

                   city colors     shape states_in_short        Timestamp
0                Ithaca    NaN  TRIANGLE              NY   6/1/1930 22:00
1           Willingboro    NaN     OTHER              NJ  6/30/1930 20:00
2               Holyoke    NaN      OVAL              CO  2/15/1931 14:00
3               Abilene    NaN      DISK              KS   6/1/1931 13:00
4  New York Worlds Fair    NaN     LIGHT              NY  4/18/1933 19:00

### Overwriting col names while reading files

In [10]:
ufo = pd.read_csv('http://bit.ly/uforeports',names = ufo_cols)

In [11]:
ufo.head()

,city,colors,shape,states_in_short,Timestamp
0,City,Colors Reported,Shape Reported,State,Time
1,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
2,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
3,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
4,Abilene,NaN,DISK,KS,6/1/1931 13:00

**Here we have to mention first row is a header & we have tell to overwrite that**

In [18]:
ufo = pd.read_csv('http://bit.ly/uforeports',names = ufo_cols,header=0)

In [13]:
ufo.head()

                   city colors     shape states_in_short        Timestamp
0                Ithaca    NaN  TRIANGLE              NY   6/1/1930 22:00
1           Willingboro    NaN     OTHER              NJ  6/30/1930 20:00
2               Holyoke    NaN      OVAL              CO  2/15/1931 14:00
3               Abilene    NaN      DISK              KS   6/1/1931 13:00
4  New York Worlds Fair    NaN     LIGHT              NY  4/18/1933 19:00

#### TIP: when you need to insert/delete spaces in all the column names , if  a dataset contains more than 100 fields, the task can be done easily by the following steps

In [14]:
ufo.columns

Index(['city', 'colors', 'shape', 'states_in_short', 'Timestamp'], dtype='object')

In [15]:
ufo.columns.str.replace('_',' ')

Index(['city', 'colors', 'shape', 'states in short', 'Timestamp'], dtype='object')

**Note the _ can be replaced with spaces in the field names**

In [16]:
ufo.shape

(18241, 5)

### Dropping columns

In [17]:
ufo.drop('Timestamp',axis=1)

                       city colors     shape states_in_short
0                    Ithaca    NaN  TRIANGLE              NY
1               Willingboro    NaN     OTHER              NJ
2                   Holyoke    NaN      OVAL              CO
3                   Abilene    NaN      DISK              KS
4      New York Worlds Fair    NaN     LIGHT              NY
...                     ...    ...       ...             ...
18236            Grant Park    NaN  TRIANGLE              IL
18237           Spirit Lake    NaN      DISK              IA
18238           Eagle River    NaN       NaN              WI
18239           Eagle River    RED     LIGHT              WI
18240                  Ybor    NaN      OVAL              FL

[18241 rows x 4 columns]

In [19]:
ufo.head()

                   city colors     shape states_in_short        Timestamp
0                Ithaca    NaN  TRIANGLE              NY   6/1/1930 22:00
1           Willingboro    NaN     OTHER              NJ  6/30/1930 20:00
2               Holyoke    NaN      OVAL              CO  2/15/1931 14:00
3               Abilene    NaN      DISK              KS   6/1/1931 13:00
4  New York Worlds Fair    NaN     LIGHT              NY  4/18/1933 19:00

In [20]:
ufo.drop('Timestamp',axis = 1 , inplace = True)

In [21]:
ufo.head()

                   city colors     shape states_in_short
0                Ithaca    NaN  TRIANGLE              NY
1           Willingboro    NaN     OTHER              NJ
2               Holyoke    NaN      OVAL              CO
3               Abilene    NaN      DISK              KS
4  New York Worlds Fair    NaN     LIGHT              NY

### Multiple column drop

In [22]:
ufo.drop(['colors','shape'],axis = 1, inplace = True)

In [23]:
ufo.head()

                   city states_in_short
0                Ithaca              NY
1           Willingboro              NJ
2               Holyoke              CO
3               Abilene              KS
4  New York Worlds Fair              NY

## Dropping rows

In [24]:
ufo.drop(0,axis=0,inplace=True)

In [25]:
ufo.head()

                   city states_in_short
1           Willingboro              NJ
2               Holyoke              CO
3               Abilene              KS
4  New York Worlds Fair              NY
5           Valley City              ND

**Here the first row is dropped**

In [28]:
ufo.drop([1,2],axis=0,inplace=True)

In [29]:
ufo.head()

                   city states_in_short
3               Abilene              KS
4  New York Worlds Fair              NY
5           Valley City              ND
6           Crater Lake              CA
7                  Alma              MI

In [30]:
ufo.shape

(18238, 2)

Notice here the no of rows is decreased